twitance/app/controllers/twitters_controller.rb

	def create
		@tweet = Twitter.new(params[:tweet])
		@tweet.save
---
INSERT INTO "twitters" ("created_at", "handle", "tweet", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 18 Dec 2013 10:18:37 UTC +00:00], ["handle", "rohitkhatana3"], ["tweet", "Ruby is the  one"], ["updated_at", Wed, 18 Dec 2013 10:18:37 UTC +00:00]]

	def show
		@tweet = Twitter.find(params[:id])
		if @tweet
			p "tweet exit"
		else
			p "not exits"
		end
		#@sea = Twitter.search(params)#all #search(:facet => { })

		@sea = Twitter.search do
---
SELECT "twitters".* FROM "twitters" WHERE "twitters"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "twitters".* FROM "twitters"